experimental_cases/STR_500mL_rotating_oldGeo/0/T.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      T.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [0 0 0 1 0 0 0];

internalField       uniform 293.15;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    walls
    {
        type            zeroGradient;
    }
    outlet
    {
        type            inletOutlet;
        phi             phi.liquid;
        inletValue      $internalField;
        value           $internalField;
    }
    "vessel|shaft|walls|impeller.*"
    {
        type            zeroGradient;
    }
    
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    
    nonCouple
    {
        type            zeroGradient;
    }


}

// ************************************************************************* //
