experimental_cases/STR_500mL_rotating_oldGeo/0/fDefault.gas
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      fdefault;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        phi             phi.gas;
        inletValue      $internalField;
        value           $internalField;
    }

    "vessel|shaft|walls|impeller.*"
    {
        type            zeroGradient;
    }

    nonCouple
    {
        type            zeroGradient;
    }

}

sources
{
    phaseChange
    {
  //      type                interfacialGrowthSizeGroup;
        type   uniformInletOutlet;
        uniformInletValue 0;
    }

    massSource
    {
        type   uniformInletOutlet;
        uniformInletValue 0;
    }
}

// ************************************************************************* //
