experimental_cases/STR_500mL_rotating_oldGeo/constant/caseVars
VVM 0.5000000000;
liqVol 0.0005000000;
HtBcol 0.1350702351;
DiaBcol 0.0840127579;
LiqHt 0.0857301458;
grav 1.6200000000;
//Uin 0.031412994;
Uin 0.062825988;
viscousFactor 4.0000000000;
N2_in 0.0000000000;
O2_in 0.0000000000;
H2_in 0.1550000000;
CO2_in 0.8450000000;
sigmaLiq 0.0720000000;
