experimental_cases/STR_500mL_rotating_oldGeo/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    ( -0.0425 0     -0.0425)
    (  0.0425 0     -0.0425 )
    (  0.0425 0.135 -0.0425 )
    ( -0.0425 0.135 -0.0425 )
    ( -0.0425 0      0.0425 )
    (  0.0425 0      0.0425 )
    (  0.0425 0.135  0.0425 )
    ( -0.0425 0.135  0.0425 )
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (53 82 53) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    wall others
    (

        (0 4 7 3)
        (2 6 5 1)
        (0 3 2 1)
        (4 5 6 7)
    )
    
    patch bottom
    (
        (1 5 4 0)
    )
    patch outlet
    (
        (3 7 6 2)
    )

);

// ************************************************************************* //
