experimental_cases/STR_500mL_rotating_oldGeo/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

patches
(

  {
        // Name of new patch
        name    vessel;

        // Dictionary to construct new patch from
        patchInfo
        {
            type    wall;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom patches;

        // If constructFrom = patches : names of patches. Wildcards allowed.
        patches (bottom vessel);
    } 

    {
        // Name of new patch
        name    inlet;

        // Dictionary to construct new patch from
        patchInfo
        {
            type    patch;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom zone;

        // If constructFrom = set : name of faceSet
        zone     inlet;
    }


);

// ************************************************************************* //
