experimental_cases/STR_500mL_rotating_oldGeo/system/createZonesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createZonesDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
inlet
{

    type        annulus;
    zoneType    face;

    point1 (0 -1 0);
    point2 (0 0.0001 0);
    outerRadius 0.024;
    innerRadius 0.022;
}

baffles
{
    type union;
    
    baffle1
    {
        type        box;
        zoneType    face;

        box     (-0.001 -1 0.13) (0.001 1 1);
    };
    
    baffle2
    {
        type        box;
        zoneType    face;

        box     (0.13 -1 -0.001 ) (1  1 0.001);
    };

    baffle3
    {
        type        box;
        zoneType    face;

        box     (-0.001 -1 -1) (0.001  1 -0.13);
    };

    baffle4
    {
        type        box;
        zoneType    face;

        box     (-0.001 -1 0.13) (0.001 1 1);
    };
}


// ************************************************************************* //
