experimental_cases/STR_500mL_rotating_oldGeo/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(/*
    {
        action  new;
        type    faceSet;
        name    baffles;
        source  boxToFace;
        box     (-1  -1 -0.001) (-0.13  1 0.001);
    }
    {
        action  add;
        type    faceSet;
        name    baffles;
        source  boxToFace;
        box     (0.13 -1 -0.001 ) (1  1 0.001);
    }
    {
        action  add;
        type    faceSet;
        name    baffles;
        source  boxToFace;
        box     (-0.001 -1 -1) (0.001  1 -0.13);
    }
    {
        action  add;
        type    faceSet;
        name    baffles;
        source  boxToFace;
        box     (-0.001 -1 0.13) (0.001 1 1);
    }
    */
    
    {
        action  new;
        type    faceSet;
        name    inlet;
        source  cylinderAnnulusToFace;
        p1 (0 -1 0);
        p2 (0 -0.159 0);
        outerRadius 0.13;
        innerRadius 0.12;
    } 
/*
    {
        action  new;
        type    faceSet;
        name    inlet;
        source  boxToFace;
        box     (-0.1  -1 -0.1) (0.1  -0.1599 0.1);
    }*/
);

// ************************************************************************* //
